{
  "backend/main.mo": "Motoko actor implementing access-controlled user profiles and chat storage with functions to manage profiles and post or fetch chat messages.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files including styles, app structure, auth, profile, chat, hooks, and about page.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main UI layout with header, navigation, authentication-aware views, and routing between About, Chat, and Profile sections.",
  "frontend/src/components/auth/AuthGate.tsx": "Component that blocks access to children until authentication is complete, showing loading or sign-in prompts.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth flow and clearing React Query cache on logout.",
  "frontend/src/features/about/AboutPage.tsx": "Public onboarding page explaining DM Networks, how to sign in, set up a profile, and start chatting with attribution to DMC Technologies.",
  "frontend/src/features/chat/ChatPage.tsx": "Authenticated live chat page with message list, auto-scroll, message composer, refresh, and author display resolution.",
  "frontend/src/features/chat/useAuthorDisplayNames.ts": "Hook that retrieves a user’s profile to derive a display name or fallback to Anonymous User.",
  "frontend/src/features/profile/ProfileForm.tsx": "React form component for editing and validating a user profile with fields for display name, bio, and social links before saving.",
  "frontend/src/features/profile/ProfilePage.tsx": "Profile page that loads the user's profile, displays a loading state, and saves updates using ProfileForm and backend hooks.",
  "frontend/src/features/profile/validateProfile.ts": "Validation helpers for profile fields including display name, bio length, and URL‑validated social links.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useAuth.ts": "Simple auth hook exposing authentication status and principal from Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity auth, login, stored identity restoration, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating profiles and chat messages using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind config defining theme extensions for colors, radius, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata listing existing features, pending requests, and overall app summary for a DM Networks chat app."
}