{
  "backend/main.mo": "Main actor managing user profiles with visibility rules, chat messages, and access‑controlled operations using AccessControl and MixinAuthorization.",
  "backend/migration.mo": "Migration module converting old user profiles to the new format by adding a default empty number field.",
  "feature_evidence.json": "Feature evidence report mapping product requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "Base HTML document loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Top‑level application shell handling navigation between About, Chat, Members, and Profile views with authentication‑aware UI.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication wrapper that shows a sign‑in prompt until the user is logged in.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity authentication and clearing React Query cache on logout.",
  "frontend/src/features/about/AboutPage.tsx": "Renders the About page describing the platform and onboarding steps using cards and icons.",
  "frontend/src/features/chat/ChatPage.tsx": "Implements the chat interface with message display, sending, admin deletion, and real-time updates.",
  "frontend/src/features/chat/useAuthorDisplayNames.ts": "Returns a user's display name from their profile or a default anonymous label.",
  "frontend/src/features/members/MembersPage.tsx": "Shows a members directory with search and filtering, gated by authentication.",
  "frontend/src/features/profile/ProfileForm.tsx": "Provides a form to edit and validate user profiles including visibility and optional fields.",
  "frontend/src/features/profile/ProfilePage.tsx": "Loads the user's profile and renders the profile form with save handling.",
  "frontend/src/features/profile/validateProfile.ts": "Validates profile fields such as display name, bio, links, and public-profile business fields.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useAuth.ts": "Exposes authentication status and principal from Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for profiles, chat messages, admin checks, and member directory using an actor from the backend.",
  "frontend/src/index.css": "Sets global Tailwind styles and custom CSS variables for color themes and typography, including dark mode variants.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, spacing, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project metadata describing app features, requirements, architecture notes, and current state version."
}