{
  "kind": "build_request",
  "title": "Admin-assigned verified badge for users (manual)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-25",
      "text": "Add backend support for a manual, administrator-assigned \"Verified\" user badge that can be toggled on/off per user principal and cannot be self-assigned by normal users.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "je veux pouvoir attribuer des badges aux utlisateurs vérifé. c'est une option manuelle"
        ]
      },
      "acceptanceCriteria": [
        "Backend stores a per-user \"Verified\" badge state keyed by Principal (default: not verified).",
        "An admin-only update method exists to set/unset the Verified badge for a target Principal; non-admin callers are rejected with an authorization error.",
        "A read method exists to retrieve whether a given Principal is verified (usable by the frontend for rendering badges)."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Expose verified badge information in existing directory/profile read flows so the frontend can display it without breaking privacy rules (badge visibility is not restricted by profile visibility).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "je veux pouvoir attribuer des badges aux utlisateurs vérifé. c'est une option manuelle"
        ]
      },
      "acceptanceCriteria": [
        "Members directory entries include verified status for each returned principal.",
        "User-profile reads for a given principal provide verified status for that principal (even when the profile itself is private to the viewer).",
        "Existing profile visibility filtering (public vs private fields and number clearing) continues to behave exactly as before; only the badge is additionally available."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Add React Query hooks for (1) reading verified badge status and (2) admin-only toggling of a user’s verified badge, using the authenticated actor and invalidating affected caches.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "je veux pouvoir attribuer des badges aux utlisateurs vérifé. c'est une option manuelle"
        ]
      },
      "acceptanceCriteria": [
        "A query hook exists to fetch verified status for a given Principal (or uses verified status included in the members directory response).",
        "A mutation hook exists to set/unset verified status for a given Principal and handles loading/error states.",
        "On success, relevant queries are invalidated so the Members directory and any cached user profile lookups refresh (e.g., invalidate memberDirectory, userProfile, and chat-related author lookups if applicable)."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Display a \"Verified\" badge in the UI wherever user identity is shown, and provide an admin-only manual control to toggle it from the Members Directory.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "je veux pouvoir attribuer des badges aux utlisateurs vérifé. c'est une option manuelle"
        ]
      },
      "acceptanceCriteria": [
        "Members Directory: verified users show a clear \"Verified\" badge next to the display name (English label: \"Verified\").",
        "Live Chat: when rendering each message author, show a \"Verified\" badge next to the author display name when that author is verified.",
        "Members Directory: if the signed-in user is an admin, each member card includes a manual control to set/unset the member’s Verified badge; non-admins do not see the control.",
        "Admin toggle action shows sensible loading/disabled states and an English error toast/message if it fails."
      ]
    }
  ],
  "constraints": [
    "Use English for all user-facing text (e.g., badge label \"Verified\", errors, button labels).",
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not edit frontend files under frontend/src/components/ui or other immutablePaths; compose existing UI components instead.",
    "Do not use WebSockets or real-time subscriptions; keep existing polling approach for chat.",
    "Preserve existing profile visibility rules and the existing \"Number\" field privacy behavior."
  ],
  "nonGoals": [
    "Automatic verification logic (e.g., based on phone/email/domain) is out of scope; verification is manual only.",
    "Third-party verification services or external databases are out of scope.",
    "A full admin dashboard page is out of scope unless required to support the Members page manual toggle."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}