{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Manual Verified badge UI + admin toggle (frontend)",
  "requirements": [
    {
      "id": "REQ-27",
      "summary": "Add React Query hooks to read and admin-toggle a user’s Verified badge, using the authenticated actor and invalidating relevant caches.",
      "acceptanceCriteria": [
        "A query hook exists to fetch verified status for a given Principal (or uses verified status included in the members directory response).",
        "A mutation hook exists to set/unset verified status for a given Principal and handles loading/error states.",
        "On success, relevant queries are invalidated so the Members directory and any cached user profile lookups refresh (e.g., invalidate memberDirectory, userProfile, and chat-related author lookups if applicable)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for verified badges: (1) a query hook to read verified status for a Principal via the authenticated actor, and/or a helper that can derive status from cached Members Directory data; (2) an admin-only mutation hook that toggles a user’s Verified badge via the actor and exposes loading/error states. Ensure on success that cached queries are invalidated so UI refreshes (memberDirectory, userProfile, and any chat/author-related lookups as applicable). Use the existing authorization/authenticated-actor flow from the selected \"authorization\" component (role-based access control expectations); Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Show a Verified badge wherever user identity is displayed and add an admin-only toggle control on Members Directory cards with proper UX and error handling.",
      "acceptanceCriteria": [
        "Members Directory: verified users show a clear \"Verified\" badge next to the display name (English label: \"Verified\").",
        "Live Chat: when rendering each message author, show a \"Verified\" badge next to the author display name when that author is verified.",
        "Members Directory: if the signed-in user is an admin, each member card includes a manual control to set/unset the member’s Verified badge; non-admins do not see the control.",
        "Admin toggle action shows sensible loading/disabled states and an English error toast/message if it fails."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/user/VerifiedBadge.tsx",
          "operation": "create",
          "description": "Create a small presentational \"Verified\" badge component (English label: \"Verified\") composed from existing shadcn/ui primitives (e.g., Badge) and optional iconography, without editing any immutable ui components. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/members/MembersPage.tsx",
          "operation": "modify",
          "description": "Update member cards to render the new VerifiedBadge next to the display name when the directory entry indicates the member is verified. Add an admin-only manual control on each member card (using existing isCallerAdmin query state and the new toggle mutation hook) to toggle verified status, with sensible disabled/loading states. On failure, show an English error toast/message and keep non-admins from seeing any toggle control. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/chat/useAuthorDisplayNames.ts",
          "operation": "modify",
          "description": "Extend the author identity helper(s) to also provide verified status for a given author (e.g., by calling the new verified-status query hook) so chat rendering can decide whether to show VerifiedBadge next to the author display name. Keep behavior consistent with existing profile visibility rules (badge display should not depend on profile visibility). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/chat/ChatPage.tsx",
          "operation": "modify",
          "description": "When rendering each message author, display the VerifiedBadge next to the author display name whenever the author is verified, using the updated author identity helper(s). Ensure no real-time subscriptions are introduced (keep existing polling). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}